In [8]:
import pandas as pd
d={
    "company":["google","apple","amazon","windows"],
    "application":["google assistant","pakodi siri","alexa","cortana"]
}

In [11]:
d["location"]=["anakapalli","jyothi nagar","kmp","chinn"]

In [12]:
df=pd.DataFrame(d)

In [13]:
df

   company       application      location
0   google  google assistant    anakapalli
1    apple       pakodi siri  jyothi nagar
2   amazon             alexa           kmp
3  windows           cortana         chinn

In [15]:
df.pivot(index="company",columns="location",values="application")

location        anakapalli    chinn jyothi nagar    kmp
company
amazon                 NaN      NaN          NaN  alexa
apple                  NaN      NaN  pakodi siri    NaN
google    google assistant      NaN          NaN    NaN
windows                NaN  cortana          NaN    NaN

In [19]:
g=df.groupby("company")

In [21]:
g.get_group("apple")

  company  application      location
1   apple  pakodi siri  jyothi nagar